Revit 2027 API
EnergyDataSettings.CheckProjectPhase Method
 Checks that the input element is a project phase.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CheckProjectPhase(
	ElementId projectPhaseId
)
Public Function CheckProjectPhase (
	projectPhaseId As ElementId
) As Boolean
public:
bool CheckProjectPhase(
	ElementId^ projectPhaseId
)
member CheckProjectPhase :
        projectPhaseId : ElementId -> bool
Parameters
projectPhaseId ElementId
 The element to be checked.
Return Value
Boolean
 True if the input element is a project phase, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace